[
    {
        "date": "2023-Act",
        "title": "Web Digital Ark",
        "description": "At Web Digital Ark, I work as a front-end developer, collaborating in projects for high profile clients such as Nissan, Stella Artois, Cencosud, Enel, Universidad Uniminuto and IICA. My work includes the development and maintenance of Drupal and WordPress websites, where I am in charge of configuration, customization and basic maintenance, always focused on providing an optimal user experience and reliable performance. In addition, I support projects in React, improving usability and creating interfaces that are visually appealing and functional. To facilitate collaboration, I use GitHub for version control, which ensures an orderly and efficient team workflow. I work in a Linux environment, which allows me to develop fluidly. I also employ Sass to optimize CSS and perform REST API integrations, allowing for robust cross-platform data communication. In specific projects, I set up development environments with Docker and use tools like PHP and JavaScript to implement additional functionalities.",
        "img": "/img/webdigitalark.png"
    },
    {
        "date": "2022-2023",
        "title": "Fundaci칩n Santa Fe de Bogot치",
        "description": "At Fundaci칩n Santa Fe, I performed preventive and corrective maintenance of biomedical equipment classified as I, IIa, IIb and III. This work covered a wide range of hospital services, including surgery, hospitalization, pediatrics, maternity, outpatient and nuclear medicine. As part of my responsibilities, I continuously monitored the maintenance of diagnostic imaging equipment and ensured that biomedical equipment was in optimal condition for use in surgical procedures through a process of verification and preparation. In addition, I used specialized software for the planning, execution and closure of maintenance, which allowed me to manage the processes in an efficient and documented manner. I was also responsible for the maintenance of laboratory equipment, ensuring its accuracy and functionality to support reliable clinical diagnostics and analysis. This work oriented to quality control contributed positively to maintain safety and effectiveness standards in the hospital services of Fundaci칩n Santa Fe.",
        "img": "/img/santafelogo.png"
    },    
    {
        "date": "2017-2019",
        "title": "PUBLILASER PATMAR",
        "description": "At Publilaser Patmar, I played a role in the creation and management of advertising graphic content, ranging from the design of cards, invoices and advertisements to the follow-up of printing processes and preparation of products for final delivery. My tasks included the creation of various visual pieces, such as newsletters, calendars and other promotional materials. To carry out these tasks, I used Corel Draw as my main tool, allowing me to create designs. In addition, I operated specialized paper cutting machinery. I also participated in the creation of audiovisual content that supported and strengthened the advertising campaigns, ensuring a visually attractive and effective message.",
        "img": "/img/empresa1.png"
    }
]